#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```    }

  # module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "297f1512-25cf-40bc-a164-74d164682ab7" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "digitaltrust" -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "297f1512-25cf-40bc-a164-74d164682ab7" -> null
      - id         = "digitaltrust/297f1512-25cf-40bc-a164-74d164682ab7" -> null
      - realm_id   = "digitaltrust" -> null
      - role_ids   = [
          - "046368f6-a84d-4f6b-a311-e51a157b850c",
        ] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-admin-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "95022138-9f33-4e51-993b-52e7cbf42acb" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-admin-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "digitaltrust" -> null
      - service_account_user_id                    = "180e0051-9eb1-442f-8c72-1a6d8ad8bfbd" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "180e0051-9eb1-442f-8c72-1a6d8ad8bfbd/046368f6-a84d-4f6b-a311-e51a157b850c" -> null
      - realm_id                = "digitaltrust" -> null
      - role                    = "realm-admin" -> null
      - service_account_user_id = "180e0051-9eb1-442f-8c72-1a6d8ad8bfbd" -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "78abc2db-1146-486a-9814-d695422d27b0",
        ] -> null
      - id              = "046368f6-a84d-4f6b-a311-e51a157b850c" -> null
      - name            = "realm-admin" -> null
      - realm_id        = "digitaltrust" -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "0b3c4a97-d2e8-4012-94d0-4e257c1bad4c" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "digitaltrust" -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "0b3c4a97-d2e8-4012-94d0-4e257c1bad4c" -> null
      - id         = "digitaltrust/0b3c4a97-d2e8-4012-94d0-4e257c1bad4c" -> null
      - realm_id   = "digitaltrust" -> null
      - role_ids   = [
          - "07b40c0a-9a7c-4818-b60f-04b510bf2ac4",
        ] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-viewer-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "82f042d4-b912-4ea4-9b50-cde680488d6c" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-viewer-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "digitaltrust" -> null
      - service_account_user_id                    = "9984e3dd-46b6-43a3-aab0-2e8a14184212" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "9984e3dd-46b6-43a3-aab0-2e8a14184212/07b40c0a-9a7c-4818-b60f-04b510bf2ac4" -> null
      - realm_id                = "digitaltrust" -> null
      - role                    = "realm-viewer" -> null
      - service_account_user_id = "9984e3dd-46b6-43a3-aab0-2e8a14184212" -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "643f0b11-d23f-42ba-94d1-9df3b1c93e2e",
          - "845acd00-65a1-4076-bf4c-7b8611f4aaa8",
          - "8b6db612-1953-4a85-8a38-ff2ec61c3b44",
          - "9f8e801b-dfb7-4ba7-b9a8-a3c9c1d03713",
          - "b82ca137-5883-4053-a7a5-ba010d6df231",
          - "f4e4d73a-e043-45d3-877d-929a4b1c0e9d",
        ] -> null
      - id              = "07b40c0a-9a7c-4818-b60f-04b510bf2ac4" -> null
      - name            = "realm-viewer" -> null
      - realm_id        = "digitaltrust" -> null
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "d65e87b4-0c94-4000-9ce2-3401848bfe2b" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "digitaltrust" -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "d65e87b4-0c94-4000-9ce2-3401848bfe2b" -> null
      - id         = "digitaltrust/d65e87b4-0c94-4000-9ce2-3401848bfe2b" -> null
      - realm_id   = "digitaltrust" -> null
      - role_ids   = [
          - "6af6f8f0-9f5f-4a76-a282-d8cb0afe7419",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-admin-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "ece6b9b1-a150-4cee-8989-973ad138be91" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-admin-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "digitaltrust" -> null
      - service_account_user_id                    = "aa1391ff-da1f-49f1-8900-494455242f24" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "aa1391ff-da1f-49f1-8900-494455242f24/6af6f8f0-9f5f-4a76-a282-d8cb0afe7419" -> null
      - realm_id                = "digitaltrust" -> null
      - role                    = "realm-admin" -> null
      - service_account_user_id = "aa1391ff-da1f-49f1-8900-494455242f24" -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_admin.module.realm_admin.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "bf490dfa-9896-4cb3-8a56-e5fd221f31c0",
        ] -> null
      - id              = "6af6f8f0-9f5f-4a76-a282-d8cb0afe7419" -> null
      - name            = "realm-admin" -> null
      - realm_id        = "digitaltrust" -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "dfec2f1b-150f-46f4-b792-167e2e165806" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "digitaltrust" -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "dfec2f1b-150f-46f4-b792-167e2e165806" -> null
      - id         = "digitaltrust/dfec2f1b-150f-46f4-b792-167e2e165806" -> null
      - realm_id   = "digitaltrust" -> null
      - role_ids   = [
          - "03cc7b67-7c29-41d4-9983-b3382438d9be",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-viewer-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "06631f2d-8990-47e3-adc3-090646e79998" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-viewer-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "digitaltrust" -> null
      - service_account_user_id                    = "0474d892-2407-46ca-a81a-4193f53c2f5f" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "0474d892-2407-46ca-a81a-4193f53c2f5f/03cc7b67-7c29-41d4-9983-b3382438d9be" -> null
      - realm_id                = "digitaltrust" -> null
      - role                    = "realm-viewer" -> null
      - service_account_user_id = "0474d892-2407-46ca-a81a-4193f53c2f5f" -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust.module.realm_viewer.module.realm_viewer.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "328390d0-2ceb-40bc-92b6-06abfa4a19ca",
          - "5eb59522-9c32-46d1-b346-d28e72b7456f",
          - "6e8f139b-6d7c-441c-aa0c-e2ca3fcab2c8",
          - "7d27ece3-bd0d-4099-9d42-1b79940996eb",
          - "be96879e-bc30-4f17-9490-e0f4b2e2557b",
          - "f91bfa2d-d891-4c63-9f0b-336db2209bff",
        ] -> null
      - id              = "03cc7b67-7c29-41d4-9983-b3382438d9be" -> null
      - name            = "realm-viewer" -> null
      - realm_id        = "digitaltrust" -> null
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

Plan: 48 to add, 0 to change, 48 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...```

</details>

*Pusher: @arcshiftsolutions, Action: `pull_request`*